{
    "model_name": "Vision Transformer",
    "hyperparameters": {
        "learning_rate": 0.001,
        "batch_size": 32,
        "epochs": 12,
        "optimizer": "adam",
        "early_stopping_patience": 3
    },
    "model_architecture": {
        "class_name": "Functional",
        "config": {
            "name": "model",
            "trainable": true,
            "layers": [
                {
                    "module": "keras.layers",
                    "class_name": "InputLayer",
                    "config": {
                        "batch_input_shape": [
                            null,
                            32,
                            32,
                            1
                        ],
                        "dtype": "float32",
                        "sparse": false,
                        "ragged": false,
                        "name": "input_1"
                    },
                    "registered_name": null,
                    "name": "input_1",
                    "inbound_nodes": []
                },
                {
                    "module": "keras.layers",
                    "class_name": "Conv2D",
                    "config": {
                        "name": "conv2d",
                        "trainable": true,
                        "dtype": "float32",
                        "filters": 3,
                        "kernel_size": [
                            3,
                            3
                        ],
                        "strides": [
                            1,
                            1
                        ],
                        "padding": "same",
                        "data_format": "channels_last",
                        "dilation_rate": [
                            1,
                            1
                        ],
                        "groups": 1,
                        "activation": "linear",
                        "use_bias": true,
                        "kernel_initializer": {
                            "module": "keras.initializers",
                            "class_name": "GlorotUniform",
                            "config": {
                                "seed": null
                            },
                            "registered_name": null
                        },
                        "bias_initializer": {
                            "module": "keras.initializers",
                            "class_name": "Zeros",
                            "config": {},
                            "registered_name": null
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            null,
                            32,
                            32,
                            1
                        ]
                    },
                    "name": "conv2d",
                    "inbound_nodes": [
                        [
                            [
                                "input_1",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "module": "keras.layers",
                    "class_name": "Rescaling",
                    "config": {
                        "name": "rescaling",
                        "trainable": true,
                        "dtype": "float32",
                        "scale": 0.00392156862745098,
                        "offset": 0.0
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            null,
                            32,
                            32,
                            3
                        ]
                    },
                    "name": "rescaling",
                    "inbound_nodes": [
                        [
                            [
                                "conv2d",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "module": "keras.layers",
                    "class_name": "Conv2D",
                    "config": {
                        "name": "conv2d_1",
                        "trainable": true,
                        "dtype": "float32",
                        "filters": 32,
                        "kernel_size": [
                            4,
                            4
                        ],
                        "strides": [
                            4,
                            4
                        ],
                        "padding": "valid",
                        "data_format": "channels_last",
                        "dilation_rate": [
                            1,
                            1
                        ],
                        "groups": 1,
                        "activation": "linear",
                        "use_bias": true,
                        "kernel_initializer": {
                            "module": "keras.initializers",
                            "class_name": "GlorotUniform",
                            "config": {
                                "seed": null
                            },
                            "registered_name": null
                        },
                        "bias_initializer": {
                            "module": "keras.initializers",
                            "class_name": "Zeros",
                            "config": {},
                            "registered_name": null
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            null,
                            32,
                            32,
                            3
                        ]
                    },
                    "name": "conv2d_1",
                    "inbound_nodes": [
                        [
                            [
                                "rescaling",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "module": "keras.layers",
                    "class_name": "Reshape",
                    "config": {
                        "name": "reshape",
                        "trainable": true,
                        "dtype": "float32",
                        "target_shape": [
                            64,
                            32
                        ]
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            null,
                            8,
                            8,
                            32
                        ]
                    },
                    "name": "reshape",
                    "inbound_nodes": [
                        [
                            [
                                "conv2d_1",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "module": "keras.layers",
                    "class_name": "LayerNormalization",
                    "config": {
                        "name": "layer_normalization",
                        "trainable": true,
                        "dtype": "float32",
                        "axis": [
                            2
                        ],
                        "epsilon": 1e-06,
                        "center": true,
                        "scale": true,
                        "beta_initializer": {
                            "module": "keras.initializers",
                            "class_name": "Zeros",
                            "config": {},
                            "registered_name": null
                        },
                        "gamma_initializer": {
                            "module": "keras.initializers",
                            "class_name": "Ones",
                            "config": {},
                            "registered_name": null
                        },
                        "beta_regularizer": null,
                        "gamma_regularizer": null,
                        "beta_constraint": null,
                        "gamma_constraint": null
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            null,
                            64,
                            32
                        ]
                    },
                    "name": "layer_normalization",
                    "inbound_nodes": [
                        [
                            [
                                "reshape",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "module": "keras.layers",
                    "class_name": "MultiHeadAttention",
                    "config": {
                        "name": "multi_head_attention",
                        "trainable": true,
                        "dtype": "float32",
                        "num_heads": 2,
                        "key_dim": 32,
                        "value_dim": 32,
                        "dropout": 0.1,
                        "use_bias": true,
                        "output_shape": null,
                        "attention_axes": [
                            1
                        ],
                        "kernel_initializer": {
                            "module": "keras.initializers",
                            "class_name": "GlorotUniform",
                            "config": {
                                "seed": null
                            },
                            "registered_name": null
                        },
                        "bias_initializer": {
                            "module": "keras.initializers",
                            "class_name": "Zeros",
                            "config": {},
                            "registered_name": null
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null,
                        "query_shape": [
                            null,
                            64,
                            32
                        ],
                        "key_shape": [
                            null,
                            64,
                            32
                        ],
                        "value_shape": [
                            null,
                            64,
                            32
                        ]
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            null,
                            64,
                            32
                        ]
                    },
                    "name": "multi_head_attention",
                    "inbound_nodes": [
                        [
                            [
                                "layer_normalization",
                                0,
                                0,
                                {
                                    "value": [
                                        "layer_normalization",
                                        0,
                                        0
                                    ]
                                }
                            ]
                        ]
                    ]
                },
                {
                    "module": "keras.layers",
                    "class_name": "Add",
                    "config": {
                        "name": "add",
                        "trainable": true,
                        "dtype": "float32"
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            [
                                null,
                                64,
                                32
                            ],
                            [
                                null,
                                64,
                                32
                            ]
                        ]
                    },
                    "name": "add",
                    "inbound_nodes": [
                        [
                            [
                                "multi_head_attention",
                                0,
                                0,
                                {}
                            ],
                            [
                                "reshape",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "module": "keras.layers",
                    "class_name": "LayerNormalization",
                    "config": {
                        "name": "layer_normalization_1",
                        "trainable": true,
                        "dtype": "float32",
                        "axis": [
                            2
                        ],
                        "epsilon": 1e-06,
                        "center": true,
                        "scale": true,
                        "beta_initializer": {
                            "module": "keras.initializers",
                            "class_name": "Zeros",
                            "config": {},
                            "registered_name": null
                        },
                        "gamma_initializer": {
                            "module": "keras.initializers",
                            "class_name": "Ones",
                            "config": {},
                            "registered_name": null
                        },
                        "beta_regularizer": null,
                        "gamma_regularizer": null,
                        "beta_constraint": null,
                        "gamma_constraint": null
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            null,
                            64,
                            32
                        ]
                    },
                    "name": "layer_normalization_1",
                    "inbound_nodes": [
                        [
                            [
                                "add",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "module": "keras.layers",
                    "class_name": "Conv1D",
                    "config": {
                        "name": "conv1d",
                        "trainable": true,
                        "dtype": "float32",
                        "filters": 64,
                        "kernel_size": [
                            2
                        ],
                        "strides": [
                            1
                        ],
                        "padding": "same",
                        "data_format": "channels_last",
                        "dilation_rate": [
                            1
                        ],
                        "groups": 1,
                        "activation": "relu",
                        "use_bias": true,
                        "kernel_initializer": {
                            "module": "keras.initializers",
                            "class_name": "GlorotUniform",
                            "config": {
                                "seed": null
                            },
                            "registered_name": null
                        },
                        "bias_initializer": {
                            "module": "keras.initializers",
                            "class_name": "Zeros",
                            "config": {},
                            "registered_name": null
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            null,
                            64,
                            32
                        ]
                    },
                    "name": "conv1d",
                    "inbound_nodes": [
                        [
                            [
                                "layer_normalization_1",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "module": "keras.layers",
                    "class_name": "Dropout",
                    "config": {
                        "name": "dropout",
                        "trainable": true,
                        "dtype": "float32",
                        "rate": 0.1,
                        "noise_shape": null,
                        "seed": null
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            null,
                            64,
                            64
                        ]
                    },
                    "name": "dropout",
                    "inbound_nodes": [
                        [
                            [
                                "conv1d",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "module": "keras.layers",
                    "class_name": "Conv1D",
                    "config": {
                        "name": "conv1d_1",
                        "trainable": true,
                        "dtype": "float32",
                        "filters": 32,
                        "kernel_size": [
                            2
                        ],
                        "strides": [
                            1
                        ],
                        "padding": "same",
                        "data_format": "channels_last",
                        "dilation_rate": [
                            1
                        ],
                        "groups": 1,
                        "activation": "linear",
                        "use_bias": true,
                        "kernel_initializer": {
                            "module": "keras.initializers",
                            "class_name": "GlorotUniform",
                            "config": {
                                "seed": null
                            },
                            "registered_name": null
                        },
                        "bias_initializer": {
                            "module": "keras.initializers",
                            "class_name": "Zeros",
                            "config": {},
                            "registered_name": null
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            null,
                            64,
                            64
                        ]
                    },
                    "name": "conv1d_1",
                    "inbound_nodes": [
                        [
                            [
                                "dropout",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "module": "keras.layers",
                    "class_name": "Add",
                    "config": {
                        "name": "add_1",
                        "trainable": true,
                        "dtype": "float32"
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            [
                                null,
                                64,
                                32
                            ],
                            [
                                null,
                                64,
                                32
                            ]
                        ]
                    },
                    "name": "add_1",
                    "inbound_nodes": [
                        [
                            [
                                "conv1d_1",
                                0,
                                0,
                                {}
                            ],
                            [
                                "add",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "module": "keras.layers",
                    "class_name": "LayerNormalization",
                    "config": {
                        "name": "layer_normalization_2",
                        "trainable": true,
                        "dtype": "float32",
                        "axis": [
                            2
                        ],
                        "epsilon": 1e-06,
                        "center": true,
                        "scale": true,
                        "beta_initializer": {
                            "module": "keras.initializers",
                            "class_name": "Zeros",
                            "config": {},
                            "registered_name": null
                        },
                        "gamma_initializer": {
                            "module": "keras.initializers",
                            "class_name": "Ones",
                            "config": {},
                            "registered_name": null
                        },
                        "beta_regularizer": null,
                        "gamma_regularizer": null,
                        "beta_constraint": null,
                        "gamma_constraint": null
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            null,
                            64,
                            32
                        ]
                    },
                    "name": "layer_normalization_2",
                    "inbound_nodes": [
                        [
                            [
                                "add_1",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "module": "keras.layers",
                    "class_name": "MultiHeadAttention",
                    "config": {
                        "name": "multi_head_attention_1",
                        "trainable": true,
                        "dtype": "float32",
                        "num_heads": 2,
                        "key_dim": 32,
                        "value_dim": 32,
                        "dropout": 0.1,
                        "use_bias": true,
                        "output_shape": null,
                        "attention_axes": [
                            1
                        ],
                        "kernel_initializer": {
                            "module": "keras.initializers",
                            "class_name": "GlorotUniform",
                            "config": {
                                "seed": null
                            },
                            "registered_name": null
                        },
                        "bias_initializer": {
                            "module": "keras.initializers",
                            "class_name": "Zeros",
                            "config": {},
                            "registered_name": null
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null,
                        "query_shape": [
                            null,
                            64,
                            32
                        ],
                        "key_shape": [
                            null,
                            64,
                            32
                        ],
                        "value_shape": [
                            null,
                            64,
                            32
                        ]
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            null,
                            64,
                            32
                        ]
                    },
                    "name": "multi_head_attention_1",
                    "inbound_nodes": [
                        [
                            [
                                "layer_normalization_2",
                                0,
                                0,
                                {
                                    "value": [
                                        "layer_normalization_2",
                                        0,
                                        0
                                    ]
                                }
                            ]
                        ]
                    ]
                },
                {
                    "module": "keras.layers",
                    "class_name": "Add",
                    "config": {
                        "name": "add_2",
                        "trainable": true,
                        "dtype": "float32"
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            [
                                null,
                                64,
                                32
                            ],
                            [
                                null,
                                64,
                                32
                            ]
                        ]
                    },
                    "name": "add_2",
                    "inbound_nodes": [
                        [
                            [
                                "multi_head_attention_1",
                                0,
                                0,
                                {}
                            ],
                            [
                                "add_1",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "module": "keras.layers",
                    "class_name": "LayerNormalization",
                    "config": {
                        "name": "layer_normalization_3",
                        "trainable": true,
                        "dtype": "float32",
                        "axis": [
                            2
                        ],
                        "epsilon": 1e-06,
                        "center": true,
                        "scale": true,
                        "beta_initializer": {
                            "module": "keras.initializers",
                            "class_name": "Zeros",
                            "config": {},
                            "registered_name": null
                        },
                        "gamma_initializer": {
                            "module": "keras.initializers",
                            "class_name": "Ones",
                            "config": {},
                            "registered_name": null
                        },
                        "beta_regularizer": null,
                        "gamma_regularizer": null,
                        "beta_constraint": null,
                        "gamma_constraint": null
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            null,
                            64,
                            32
                        ]
                    },
                    "name": "layer_normalization_3",
                    "inbound_nodes": [
                        [
                            [
                                "add_2",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "module": "keras.layers",
                    "class_name": "Conv1D",
                    "config": {
                        "name": "conv1d_2",
                        "trainable": true,
                        "dtype": "float32",
                        "filters": 64,
                        "kernel_size": [
                            2
                        ],
                        "strides": [
                            1
                        ],
                        "padding": "same",
                        "data_format": "channels_last",
                        "dilation_rate": [
                            1
                        ],
                        "groups": 1,
                        "activation": "relu",
                        "use_bias": true,
                        "kernel_initializer": {
                            "module": "keras.initializers",
                            "class_name": "GlorotUniform",
                            "config": {
                                "seed": null
                            },
                            "registered_name": null
                        },
                        "bias_initializer": {
                            "module": "keras.initializers",
                            "class_name": "Zeros",
                            "config": {},
                            "registered_name": null
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            null,
                            64,
                            32
                        ]
                    },
                    "name": "conv1d_2",
                    "inbound_nodes": [
                        [
                            [
                                "layer_normalization_3",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "module": "keras.layers",
                    "class_name": "Dropout",
                    "config": {
                        "name": "dropout_1",
                        "trainable": true,
                        "dtype": "float32",
                        "rate": 0.1,
                        "noise_shape": null,
                        "seed": null
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            null,
                            64,
                            64
                        ]
                    },
                    "name": "dropout_1",
                    "inbound_nodes": [
                        [
                            [
                                "conv1d_2",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "module": "keras.layers",
                    "class_name": "Conv1D",
                    "config": {
                        "name": "conv1d_3",
                        "trainable": true,
                        "dtype": "float32",
                        "filters": 32,
                        "kernel_size": [
                            2
                        ],
                        "strides": [
                            1
                        ],
                        "padding": "same",
                        "data_format": "channels_last",
                        "dilation_rate": [
                            1
                        ],
                        "groups": 1,
                        "activation": "linear",
                        "use_bias": true,
                        "kernel_initializer": {
                            "module": "keras.initializers",
                            "class_name": "GlorotUniform",
                            "config": {
                                "seed": null
                            },
                            "registered_name": null
                        },
                        "bias_initializer": {
                            "module": "keras.initializers",
                            "class_name": "Zeros",
                            "config": {},
                            "registered_name": null
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            null,
                            64,
                            64
                        ]
                    },
                    "name": "conv1d_3",
                    "inbound_nodes": [
                        [
                            [
                                "dropout_1",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "module": "keras.layers",
                    "class_name": "Add",
                    "config": {
                        "name": "add_3",
                        "trainable": true,
                        "dtype": "float32"
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            [
                                null,
                                64,
                                32
                            ],
                            [
                                null,
                                64,
                                32
                            ]
                        ]
                    },
                    "name": "add_3",
                    "inbound_nodes": [
                        [
                            [
                                "conv1d_3",
                                0,
                                0,
                                {}
                            ],
                            [
                                "add_2",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "module": "keras.layers",
                    "class_name": "GlobalAveragePooling1D",
                    "config": {
                        "name": "global_average_pooling1d",
                        "trainable": true,
                        "dtype": "float32",
                        "data_format": "channels_last",
                        "keepdims": false
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            null,
                            64,
                            32
                        ]
                    },
                    "name": "global_average_pooling1d",
                    "inbound_nodes": [
                        [
                            [
                                "add_3",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "module": "keras.layers",
                    "class_name": "Dense",
                    "config": {
                        "name": "dense",
                        "trainable": true,
                        "dtype": "float32",
                        "units": 64,
                        "activation": "relu",
                        "use_bias": true,
                        "kernel_initializer": {
                            "module": "keras.initializers",
                            "class_name": "GlorotUniform",
                            "config": {
                                "seed": null
                            },
                            "registered_name": null
                        },
                        "bias_initializer": {
                            "module": "keras.initializers",
                            "class_name": "Zeros",
                            "config": {},
                            "registered_name": null
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            null,
                            32
                        ]
                    },
                    "name": "dense",
                    "inbound_nodes": [
                        [
                            [
                                "global_average_pooling1d",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "module": "keras.layers",
                    "class_name": "Dropout",
                    "config": {
                        "name": "dropout_2",
                        "trainable": true,
                        "dtype": "float32",
                        "rate": 0.1,
                        "noise_shape": null,
                        "seed": null
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            null,
                            64
                        ]
                    },
                    "name": "dropout_2",
                    "inbound_nodes": [
                        [
                            [
                                "dense",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "module": "keras.layers",
                    "class_name": "Dense",
                    "config": {
                        "name": "dense_1",
                        "trainable": true,
                        "dtype": "float32",
                        "units": 32,
                        "activation": "relu",
                        "use_bias": true,
                        "kernel_initializer": {
                            "module": "keras.initializers",
                            "class_name": "GlorotUniform",
                            "config": {
                                "seed": null
                            },
                            "registered_name": null
                        },
                        "bias_initializer": {
                            "module": "keras.initializers",
                            "class_name": "Zeros",
                            "config": {},
                            "registered_name": null
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            null,
                            64
                        ]
                    },
                    "name": "dense_1",
                    "inbound_nodes": [
                        [
                            [
                                "dropout_2",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "module": "keras.layers",
                    "class_name": "Dropout",
                    "config": {
                        "name": "dropout_3",
                        "trainable": true,
                        "dtype": "float32",
                        "rate": 0.1,
                        "noise_shape": null,
                        "seed": null
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            null,
                            32
                        ]
                    },
                    "name": "dropout_3",
                    "inbound_nodes": [
                        [
                            [
                                "dense_1",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "module": "keras.layers",
                    "class_name": "Dense",
                    "config": {
                        "name": "dense_2",
                        "trainable": true,
                        "dtype": "float32",
                        "units": 10,
                        "activation": "softmax",
                        "use_bias": true,
                        "kernel_initializer": {
                            "module": "keras.initializers",
                            "class_name": "GlorotUniform",
                            "config": {
                                "seed": null
                            },
                            "registered_name": null
                        },
                        "bias_initializer": {
                            "module": "keras.initializers",
                            "class_name": "Zeros",
                            "config": {},
                            "registered_name": null
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    },
                    "registered_name": null,
                    "build_config": {
                        "input_shape": [
                            null,
                            32
                        ]
                    },
                    "name": "dense_2",
                    "inbound_nodes": [
                        [
                            [
                                "dropout_3",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                }
            ],
            "input_layers": [
                [
                    "input_1",
                    0,
                    0
                ]
            ],
            "output_layers": [
                [
                    "dense_2",
                    0,
                    0
                ]
            ]
        },
